# Напишите программу, принимающую у пользователя ввод положительного целого числа n от 1 до 10 включительно. 

# Для всех неотрицательных целых чисел i меньше n выведите построчно результат операции i2 + 2 * i + 1


n = 4
for i in range (0,n):
    print (i**2 + 2*i + 1)