# Напиши программу
# Напишите программу, принимающую у пользователя ввод положительного целого числа a от 1 до 100 включительно и положительного целого числа b от 1 до 100 включительно.
# 
# Выведите в консоль строку равную сумме 8 * a и 9 * b.
# 
# Выведите в консоль строку равную разности 4 * a и 2 * b.
# 
# Выведите в консоль строку равную произведению 5 * a и b.

a = 3
b = 4


print (8*a + 9*b)
print (4*a - 2*b)
print (5 * a * b)