# Напишите программу, принимающую у пользователя ввод положительного целого числа a от 1 до 100 включительно и положительного целого числа b от 1 до 100 включительно.
# 
# Выведите в консоль строку равную результату целочисленного деления (нахождение неполного частного) a и b.
# Выведите в консоль строку равную результату деления с плавающей точкой чисел a и b.

a = 10
b = 4

print (a // b)
print (a / b)